CmST0us/bajji/device/sdkconfig.defaults
# ESP-IDF 6.0 defaults for M5Stack StopWatch (ESP32-S3R8).
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_FREERTOS_HZ=1000
# This firmware spends most of its time in software rendering, image decode, and packet
# copies. ESP-IDF defaults to its debug-oriented optimization unless told otherwise.
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_COMPILER_CXX_EXCEPTIONS=n
CONFIG_COMPILER_CXX_RTTI=n
CONFIG_LV_COLOR_DEPTH_16=y
# LVGL reports every decode and allocation failure through LV_LOG_WARN, which
# compiles to nothing while LV_USE_LOG is off. Without this a broken wallpaper
# just renders wrong, silently. WARN and above only, routed through printf.
CONFIG_LV_USE_LOG=y
CONFIG_LV_LOG_LEVEL_WARN=y
CONFIG_LV_LOG_PRINTF=y
CONFIG_LV_USE_FLOAT=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_32=y
CONFIG_LV_FONT_MONTSERRAT_48=y
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_BUILD_EXAMPLES=n
CONFIG_LV_BUILD_DEMOS=n
CONFIG_LV_USE_DEMO_WIDGETS=n
CONFIG_LV_USE_DEMO_BENCHMARK=n
CONFIG_LV_USE_DEMO_STRESS=n
CONFIG_LV_USE_FS_STDIO=y
CONFIG_LV_FS_STDIO_LETTER=83
CONFIG_LV_FS_STDIO_PATH="/spiffs"
CONFIG_LV_FS_STDIO_CACHE_SIZE=4096
CONFIG_LV_USE_TJPGD=y
CONFIG_LV_USE_LODEPNG=y
# Without an image cache LVGL re-decodes the wallpaper on every draw call, and a
# partial-render frame issues several. Sized to hold one fully decoded image, and
# kept in step with kDecodedLimit in wallpaper_service.cpp so anything we accept fits.
CONFIG_LV_CACHE_DEF_SIZE=2097152
CONFIG_LV_IMAGE_HEADER_CACHE_DEF_CNT=16
CONFIG_LV_USE_GIF=y
CONFIG_LV_USE_QRCODE=y
# CONFIG_LV_USE_LIBWEBP is not set
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y
# The TLS input record is slightly larger than 16 KiB. Use the default allocator so
# CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL keeps smaller objects internal while this buffer
# can use PSRAM instead of failing when contiguous internal DRAM is exhausted.
CONFIG_MBEDTLS_DEFAULT_MEM_ALLOC=y
# Google Trust Services and Cloudflare hosts send their root cross-signed by an older CA, so
# the last certificate in the chain is GTS Root R4 issued by GlobalSign Root CA. esp_crt_bundle
# looks the trust anchor up by the issuer of that last certificate (esp_crt_bundle.c:334), and
# GlobalSign Root CA is not in the bundle - GTS Root R4 itself is. Without this the handshake
# fails with "No matching trusted root certificate found" even though the root is trusted.
# Enabling it registers a per-level trusted-cert callback instead, so the chain closes at
# GTS Root R4. Costs about 700 bytes of heap.
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_CROSS_SIGNED_VERIFY=y

# Wi-Fi is the preferred uplink; NimBLE remains active as the phone fallback.
CONFIG_ESP_COEX_ENABLED=y
CONFIG_ESP_WIFI_ENABLE_WPA3_SAE=y
CONFIG_ESP_WIFI_ENABLE_WPA3_OWE_STA=y
CONFIG_ESP_NETIF_SET_DNS_PER_DEFAULT_NETIF=y
# CONFIG_BAJJI_WIFI_LOG_CREDENTIALS is not set

# NimBLE peripheral: one Secure Connections bond and one LE L2CAP CoC.
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_GATT_CLIENT=n
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_MAX_BONDS=1
CONFIG_BT_NIMBLE_NVS_PERSIST=y
CONFIG_BT_NIMBLE_MAX_CCCDS=1
CONFIG_BT_NIMBLE_SM_LEGACY=n
CONFIG_BT_NIMBLE_SM_SC=y
CONFIG_BT_NIMBLE_L2CAP_COC_MAX_NUM=1
# IDF 6.0's multi-SDU ring does not clear consumed slots; use its safe single-slot mode.
CONFIG_BT_NIMBLE_L2CAP_COC_SDU_BUFF_COUNT=1
CONFIG_BT_NIMBLE_MSYS_1_BLOCK_COUNT=30
CONFIG_BT_NIMBLE_MSYS_1_BLOCK_SIZE=512
CONFIG_BT_NIMBLE_SVC_GAP_PPCP_MIN_CONN_INTERVAL=12
CONFIG_BT_NIMBLE_SVC_GAP_PPCP_MAX_CONN_INTERVAL=12
CONFIG_BT_NIMBLE_SVC_GAP_PPCP_SLAVE_LATENCY=0
CONFIG_BT_NIMBLE_SVC_GAP_PPCP_SUPERVISION_TMO=400
CONFIG_BT_NIMBLE_PROX_SERVICE=n
CONFIG_BT_NIMBLE_ANS_SERVICE=n
CONFIG_BT_NIMBLE_CTS_SERVICE=n
CONFIG_BT_NIMBLE_HTP_SERVICE=n
CONFIG_BT_NIMBLE_IPSS_SERVICE=n
CONFIG_BT_NIMBLE_TPS_SERVICE=n
CONFIG_BT_NIMBLE_IAS_SERVICE=n
CONFIG_BT_NIMBLE_LLS_SERVICE=n
CONFIG_BT_NIMBLE_SPS_SERVICE=n
CONFIG_BT_NIMBLE_HR_SERVICE=n
CONFIG_BT_NIMBLE_BAS_SERVICE=n
CONFIG_BT_NIMBLE_DIS_SERVICE=n
